app/controllers/books_controller.rb

  def index
    @books = Book.includes(:favorited_users).sort {|a,b| b.favorited_users.size <=> a.favorited_users.size}
---
SELECT COUNT(*) FROM "users" INNER JOIN "favorites" ON "users"."id" = "favorites"."user_id" WHERE "favorites"."book_id" = ? AND "users"."created_at" >= ? AND "users"."created_at" < ?  [["book_id", 2], ["created_at", "2021-11-03 00:00:00"], ["created_at", "2021-11-09 23:59:59.999999"]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]
SELECT "books".* FROM "books"
SELECT "favorites".* FROM "favorites" WHERE "favorites"."book_id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?)  [["book_id", 1], ["book_id", 2], ["book_id", 3], ["book_id", 4], ["book_id", 5], ["book_id", 6], ["book_id", 7], ["book_id", 8], ["book_id", 9]]